tudu-ws/tudu-xfire-jaxws2/src/test/resources/soapRequest/wssecurity/getAllTodoLists-WSSP.soap.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header>
		<wsse:Security soap:mustUnderstand="1">
			<wsse:UsernameToken wsu:Id="UsernameToken-2208288">
				<wsse:Username>user</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
					user
				</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<GetAllTodoLists xmlns="http://web.ws.tudu2/v1" />
	</soap:Body>
</soap:Envelope>